{"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"input_dim": 21, "embeddings_regularizer": null, "output_dim": 21, "input_length": 31, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "embeddings_constraint": null, "mask_zero": false, "activity_regularizer": null, "name": "embedding_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 31]}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.2}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [2], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "filters": 21, "name": "conv1d_1", "dilation_rate": [1], "use_bias": true, "strides": [1], "activation": "relu", "data_format": "channels_last"}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_1", "data_format": "channels_last", "padding": "valid", "strides": [1], "pool_size": [2], "trainable": true}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [2], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "filters": 21, "name": "conv1d_2", "dilation_rate": [1], "use_bias": true, "strides": [1], "activation": "relu", "data_format": "channels_last"}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_2", "data_format": "channels_last", "padding": "valid", "strides": [1], "pool_size": [2], "trainable": true}}, {"class_name": "LSTM", "config": {"return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "stateful": false, "units": 21, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_constraint": null, "use_bias": true, "implementation": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "name": "lstm_1", "unroll": false, "go_backwards": false, "activation": "tanh", "return_state": false}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "trainable": true, "units": 1, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}