{"config": {"layers": [{"config": {"name": "embedding_1", "input_length": 31, "activity_regularizer": null, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 31], "mask_zero": false, "input_dim": 21, "output_dim": 21, "embeddings_constraint": null, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [2], "name": "conv1d_1", "filters": 21, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"config": {"strides": [1], "name": "average_pooling1d_1", "pool_size": [2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "AveragePooling1D"}, {"config": {"dilation_rate": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [2], "name": "conv1d_2", "filters": 21, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"config": {"strides": [1], "name": "average_pooling1d_2", "pool_size": [2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "AveragePooling1D"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "use_bias": true, "name": "lstm_1", "trainable": true, "unroll": false, "units": 21, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "unit_forget_bias": true, "stateful": false, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"units": 1, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}