{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"mask_zero": false, "name": "embedding_1", "batch_input_shape": [null, 31], "input_dim": 21, "embeddings_regularizer": null, "input_length": 31, "activity_regularizer": null, "output_dim": 21, "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "trainable": true, "embeddings_constraint": null}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "filters": 21, "strides": [1], "dilation_rate": [1], "data_format": "channels_last", "activation": "relu", "name": "conv1d_1", "kernel_size": [2], "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_1", "padding": "valid", "strides": [1], "data_format": "channels_last", "trainable": true, "pool_size": [2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "filters": 21, "strides": [1], "dilation_rate": [1], "data_format": "channels_last", "activation": "relu", "name": "conv1d_2", "kernel_size": [2], "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_2", "padding": "valid", "strides": [1], "data_format": "channels_last", "trainable": true, "pool_size": [2]}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "name": "lstm_1", "recurrent_constraint": null, "use_bias": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 21, "bias_regularizer": null, "recurrent_regularizer": null, "stateful": false, "return_state": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "bias_constraint": null, "activity_regularizer": null, "dropout": 0.0, "return_sequences": false, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}, "backend": "tensorflow"}