{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 31], "mask_zero": false, "embeddings_constraint": null, "name": "embedding_1", "output_dim": 21, "activity_regularizer": null, "input_length": 31, "embeddings_regularizer": null, "dtype": "float32", "input_dim": 21, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "trainable": true}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "kernel_size": [2], "filters": 21, "name": "conv1d_1", "trainable": true}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_1", "data_format": "channels_last", "strides": [1], "padding": "valid", "pool_size": [2], "trainable": true}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "kernel_size": [2], "filters": 21, "name": "conv1d_2", "trainable": true}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_2", "data_format": "channels_last", "strides": [1], "padding": "valid", "pool_size": [2], "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 21, "recurrent_regularizer": null, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "unroll": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "trainable": true, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "implementation": 1, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "stateful": false}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}]}}