{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Embedding", "config": {"mask_zero": false, "input_dim": 21, "activity_regularizer": null, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "output_dim": 21, "input_length": 31, "trainable": true, "embeddings_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 31]}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "name": "conv1d_1", "kernel_constraint": null, "strides": [1], "filters": 21, "dilation_rate": [1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [2]}}, {"class_name": "AveragePooling1D", "config": {"strides": [1], "pool_size": [2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "average_pooling1d_1"}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "name": "conv1d_2", "kernel_constraint": null, "strides": [1], "filters": 21, "dilation_rate": [1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [2]}}, {"class_name": "AveragePooling1D", "config": {"strides": [1], "pool_size": [2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "average_pooling1d_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "implementation": 1, "unroll": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "recurrent_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "units": 21, "use_bias": true, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "stateful": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "units": 1, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}], "name": "sequential_1"}}