{"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "output_dim": 21, "mask_zero": false, "input_length": 31, "activity_regularizer": null, "trainable": true, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "input_dim": 21, "dtype": "float32", "batch_input_shape": [null, 31], "embeddings_regularizer": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "filters": 21, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "trainable": true, "strides": [1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "kernel_size": [2]}}, {"class_name": "AveragePooling1D", "config": {"trainable": true, "strides": [1], "padding": "valid", "data_format": "channels_last", "name": "average_pooling1d_1", "pool_size": [2]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "filters": 21, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "trainable": true, "strides": [1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "kernel_size": [2]}}, {"class_name": "AveragePooling1D", "config": {"trainable": true, "strides": [1], "padding": "valid", "data_format": "channels_last", "name": "average_pooling1d_2", "pool_size": [2]}}, {"class_name": "LSTM", "config": {"implementation": 1, "recurrent_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "activity_regularizer": null, "unroll": false, "bias_constraint": null, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "tanh", "return_state": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_constraint": null, "units": 21, "name": "lstm_1", "dropout": 0.0, "use_bias": true, "trainable": true, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}