{"config": {"name": "sequential_1", "layers": [{"config": {"input_dim": 21, "trainable": true, "output_dim": 21, "mask_zero": false, "activity_regularizer": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "dtype": "float32", "embeddings_constraint": null, "input_length": 31, "batch_input_shape": [null, 31], "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"kernel_size": [2], "trainable": true, "dilation_rate": [1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1], "kernel_constraint": null, "activation": "relu", "padding": "valid", "filters": 21, "name": "conv1d_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"data_format": "channels_last", "strides": [1], "trainable": true, "padding": "valid", "pool_size": [2], "name": "average_pooling1d_1"}, "class_name": "AveragePooling1D"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [2], "trainable": true, "dilation_rate": [1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1], "kernel_constraint": null, "activation": "relu", "padding": "valid", "filters": 21, "name": "conv1d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"data_format": "channels_last", "strides": [1], "trainable": true, "padding": "valid", "pool_size": [2], "name": "average_pooling1d_2"}, "class_name": "AveragePooling1D"}, {"config": {"activity_regularizer": null, "recurrent_regularizer": null, "unroll": false, "kernel_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 21, "kernel_constraint": null, "unit_forget_bias": true, "name": "lstm_1", "bias_constraint": null, "return_state": false, "trainable": true, "bias_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activation": "tanh", "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "stateful": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_constraint": null, "use_bias": true, "activation": "linear", "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}, "class_name": "Activation"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}