{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"input_length": 31, "name": "embedding_1", "trainable": true, "mask_zero": false, "dtype": "float32", "output_dim": 21, "batch_input_shape": [null, 31], "embeddings_constraint": null, "input_dim": 21, "activity_regularizer": null, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.3}}, {"class_name": "Conv1D", "config": {"use_bias": true, "filters": 21, "dilation_rate": [1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "name": "conv1d_1", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [2], "padding": "valid", "kernel_constraint": null, "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_1", "strides": [1], "data_format": "channels_last", "padding": "valid", "pool_size": [2], "trainable": true}}, {"class_name": "Conv1D", "config": {"use_bias": true, "filters": 21, "dilation_rate": [1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "name": "conv1d_2", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [2], "padding": "valid", "kernel_constraint": null, "strides": [1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_2", "strides": [1], "data_format": "channels_last", "padding": "valid", "pool_size": [2], "trainable": true}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 21, "go_backwards": false, "unit_forget_bias": true, "name": "lstm_1", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "recurrent_constraint": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 1, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}, "keras_version": "2.2.4"}